Repository: mohammed-299kk/gizmo_store
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Gizmo Store
ar: متجر جيزمو

source: Home
ar: المنزل

source: Categories
ar: الفئات

source: Cart
ar: السلة

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Search
ar: البحث

# searchProducts
source: Search for products...
ar: البحث عن المنتجات...

source: Featured Products
ar: المنتجات المميزة

source: New Arrivals
ar: الوافدات الجديدة

source: Best Sellers
ar: الأكثر مبيعاً

source: View All
ar: عرض الكل

source: Add to Cart
ar: أضف إلى السلة

source: Buy Now
ar: اشتري الآن

source: Price
ar: السعر

# youAreGuestNow
source: You are a guest now
ar: أنت زائر الآن

# loginToViewProfile
source: Log in to view your profile and enjoy the full features of the app.
ar: سجل الدخول لعرض ملفك الشخصي والاستفادة من ميزات التطبيق الكاملة.

source: Go to registration page
ar: الانتقال إلى صفحة التسجيل

source: Logout
ar: تسجيل الخروج

source: New user
ar: مستخدم جديد

# userId
source: User ID (UID):
ar: معرف المستخدم

source: Registration Date
ar: تاريخ التسجيل

source: Undefined
ar: غير محدد

source: Orders
ar: الطلبات

source: Favorites
ar: المفضلة

source: My Account
ar: حسابي

source: Edit Profile
ar: تعديل الملف الشخصي

source: My Orders
ar: طلباتي

source: Addresses
ar: العناوين

# addressManagementInDevelopment
source: Address management is under development
ar: إدارة العناوين قيد التطوير

source: Application
ar: التطبيق

source: Notifications
ar: الإشعارات

# notificationManagementInDevelopment
source: Notification management is under development
ar: إدارة الإشعارات قيد التطوير

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم

# helpAndSupportInDevelopment
source: Help and support is under development
ar: المساعدة والدعم قيد التطوير

source: Privacy and Security
ar: الخصوصية والأمان

# privacyAndSecurityInDevelopment
source: Privacy and security settings are under development
ar: إعدادات الخصوصية والأمان قيد التطوير

source: About App
ar: حول التطبيق

source: Firebase Details
ar: تفاصيل Firebase

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: About Gizmo Store
ar: حول متجر جيزمو

source: Version: 1.0.0
ar: الإصدار: 1.0.0

# demoEcommerceApp
source: Demo e-commerce application.
ar: تطبيق متجر إلكتروني تجريبي.

source: OK
ar: موافق

# privacyAndSecurityTitle
source: Privacy and Security
ar: الخصوصية والأمان

source: Security Settings
ar: إعدادات الأمان

source: Privacy Settings
ar: إعدادات الخصوصية

source: Change Password
ar: تغيير كلمة المرور

source: Biometric Authentication
ar: المصادقة البيومترية

source: Manage Privacy Data
ar: إدارة بيانات الخصوصية

source: Privacy Policy
ar: سياسة الخصوصية

# changePasswordUnderDevelopment
source: Change password feature is under development
ar: ميزة تغيير كلمة المرور قيد التطوير

# biometricAuthUnderDevelopment
source: Biometric authentication feature is under development
ar: ميزة المصادقة البيومترية قيد التطوير

# managePrivacyDataUnderDevelopment
source: Manage privacy data feature is under development
ar: ميزة إدارة بيانات الخصوصية قيد التطوير

# privacyPolicyUnderDevelopment
source: Privacy policy feature is under development
ar: ميزة سياسة الخصوصية قيد التطوير

source: Description
ar: الوصف

source: reviews
ar: تقييم

source: Rating
ar: التقييم

source: In Stock
ar: متوفر

source: Out of Stock
ar: غير متوفر

source: Quantity
ar: الكمية:

source: Total
ar: المجموع

source: Subtotal
ar: المجموع الفرعي

source: Checkout
ar: الدفع

source: Search for products...
ar: البحث عن المنتجات...

source: Newest
ar: الأحدث

source: Price: Low to High
ar: السعر: من الأقل للأعلى

source: Price: High to Low
ar: السعر: من الأعلى للأقل

source: Top Rated
ar: الأعلى تقييماً

source: All
ar: الكل

source: Smartphones
ar: هواتف ذكية

source: Computers
ar: أجهزة الكمبيوتر

source: Tablets
ar: أجهزة لوحية

source: Smartwatches
ar: ساعات ذكية

source: Headphones
ar: سماعات

source: Accessories
ar: إكسسوارات

source: Failed to load products
ar: فشل في تحميل المنتجات

source: Category
ar: الفئة

source: Sort by
ar: ترتيب حسب

# priceRange
source: Price Range (EGP)
ar: السعر: من \${min} إلى \${max}

source: Brand
ar: العلامة التجارية

source: No results
ar: لا توجد نتائج

source: Reset Filters
ar: إعادة تعيين المرشحات

source: Load More
ar: عرض المزيد

# emptyCart
source: Cart is empty
ar: سلة التسوق فارغة

source: Continue Shopping
ar: متابعة التسوق

source: Account
ar: الحساب

source: Address Management
ar: إدارة العناوين

source: Shipping
ar: الشحن

source: Payment Methods
ar: طرق الدفع

source: Dark Mode
ar: الوضع المظلم

source: Language
ar: اللغة

source: Help & Support
ar: المساعدة والدعم

source: App Information
ar: معلومات التطبيق

source: Login
ar: تسجيل الدخول

source: Register
ar: التسجيل

source: Email:
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Sign Up
ar: إنشاء حساب

source: Sign In
ar: تسجيل الدخول

source: Name
ar: الاسم

source: Phone
ar: الهاتف

source: Address
ar: العنوان

source: City
ar: المدينة

source: State
ar: المحافظة

source: Postal Code
ar: الرمز البريدي

source: Country
ar: البلد

source: Save
ar: حفظ

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Add
ar: إضافة

source: Update
ar: تحديث

source: Yes
ar: نعم

source: No
ar: لا

source: Error
ar: خطأ

source: Success
ar: نجح

source: Loading...
ar: جاري التحميل...

source: Retry
ar: إعادة المحاولة

source: No internet connection
ar: لا يوجد اتصال بالإنترنت

source: Something went wrong
ar: حدث خطأ ما

source: Add Address
ar: إضافة عنوان

source: Edit Address
ar: تعديل العنوان

source: Delete Address
ar: حذف العنوان

source: Set as Default
ar: تعيين كافتراضي

source: Default Address
ar: العنوان الافتراضي

source: No addresses found
ar: لم يتم العثور على عناوين

source: Add your first address
ar: أضف عنوانك الأول

source: Street
ar: الشارع

source: Required
ar: مطلوب

# invalidEmail
source: Invalid email address
ar: البريد الإلكتروني غير صحيح

source: Password too short
ar: كلمة المرور قصيرة جداً

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# pleaseEnterValidName
source: Please enter a valid name
ar: يرجى إدخال اسم صحيح

# pleaseEnterValidPhone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# pleaseEnterValidStreet
source: Please enter a valid street address
ar: يرجى إدخال عنوان شارع صحيح

# pleaseEnterValidCity
source: Please enter a valid city
ar: يرجى إدخال مدينة صحيحة

# pleaseEnterValidState
source: Please enter a valid state
ar: يرجى إدخال محافظة صحيحة

# pleaseEnterValidPostalCode
source: Please enter a valid postal code
ar: يرجى إدخال رمز بريدي صحيح

# pleaseEnterValidCountry
source: Please enter a valid country
ar: يرجى إدخال بلد صحيح

# deleteAddressConfirmation
source: Are you sure you want to delete this address?
ar: هل أنت متأكد من حذف هذا العنوان؟

source: Address deleted successfully
ar: تم حذف العنوان بنجاح

source: Address saved successfully
ar: تم حفظ العنوان بنجاح

source: Failed to save address
ar: فشل في حفظ العنوان

source: Failed to delete address
ar: فشل في حذف العنوان

source: Failed to load addresses
ar: فشل في تحميل العناوين

# priceFormat
source: Price: {price} EGP
ar: السعر: {price} جنيه

source: Not specified
ar: غير محدد

# fillAllRequiredFields
source: Please fill all required fields
ar: يرجى ملء جميع الحقول المطلوبة

# enterFirstAndLastName
source: Please enter first and last name
ar: يرجى إدخال الاسم الأول والأخير

# passwordMinLength
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

source: Processing...
ar: جاري المعالجة...

source: Arabic
ar: العربية

source: Continue as Guest
ar: متابعة كضيف

source: Admin Login
ar: تسجيل دخول المدير

# signInSuccess
source: Sign in successful!
ar: تم تسجيل الدخول بنجاح!

# accountCreatedSuccess
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

# databaseInitDescription
source: Initializing database with sample data...
ar: جاري تهيئة قاعدة البيانات ببيانات تجريبية...

source: or
ar: أو

source: Full Name
ar: الاسم الكامل

source: Create Account
ar: إنشاء حساب

# noAccountCreateNew
source: Don't have an account? Create new
ar: ليس لديك حساب؟ أنشئ حساباً جديداً

# haveAccountSignIn
source: Already have an account? Sign in
ar: لديك حساب بالفعل؟ سجل دخولك

source: Create New Account
ar: إنشاء حساب جديد

source: Sign in to continue
ar: سجل الدخول للمتابعة

# joinGizmoFamily
source: Join the Gizmo family
ar: انضم إلى عائلة جيزمو

source: Welcome Back
ar: مرحباً بعودتك

# aboutDescription
source: Gizmo Store is your one-stop shop for all electronic gadgets and accessories.
ar: متجر جيزمو هو متجرك الشامل لجميع الأجهزة الإلكترونية والإكسسوارات.

# logoutConfirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

source: Terms of Service
ar: شروط الخدمة

source: coming soon!
ar: قريباً!

source: Rate App
ar: قيم التطبيق

# appInfo
source: App Information
ar: معلومات التطبيق

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

source: Help Center
ar: مركز المساعدة

source: Contact Us
ar: اتصل بنا

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: App launched successfully! 🎉
ar: تم تشغيل التطبيق بنجاح!

source: User Type
ar: نوع المستخدم

source: Registered User
ar: مستخدم مسجل

# appWorkingNormally
source: App is working normally now!
ar: التطبيق يعمل بشكل طبيعي الآن!

source: Navigation Buttons
ar: أزرار التنقل

source: Cart works!
ar: السلة تعمل!

source: Favorites work!
ar: المفضلة تعمل!

source: Settings work!
ar: الإعدادات تعمل!

source: Wishlist
ar: المفضلة

source: Phones
ar: الهواتف

source: Watches
ar: الساعات

source: Televisions
ar: أجهزة التلفزيون

# currency
source: SDG
ar: ج.س

source: Welcome
ar: ترحيب

source: Welcome, Guest
ar: مرحباً، ضيف

# discoverLatestProducts
source: Discover the latest products
ar: اكتشف أحدث المنتجات

source: Product Title
ar: عنوان المنتجات

# noFavoriteProducts
source: No favorite products yet
ar: لا توجد منتجات مفضلة بعد

source: added to cart
ar: تمت الإضافة إلى السلة

source: View Cart
ar: عرض السلة

source: Guest
ar: ضيف

source: Firebase Settings
ar: إعدادات Firebase

# homeTab
source: Home
ar: الرئيسية

# categoriesTab
source: Categories
ar: الفئات

# favoritesTab
source: Favorites
ar: المفضلة

# accountTab
source: Account
ar: الحساب

# errorLoadingProducts
source: Error loading products: {error}
ar: خطأ في تحميل المنتجات: {error}

source: Welcome to Gizmo Store!
ar: مرحباً بك في Gizmo Store!

# discoverLatestTechProducts
source: Discover the latest tech products
ar: اكتشف أحدث المنتجات التقنية

source: All Products
ar: جميع المنتجات

source: General
ar: عام

source: No favorite products yet
ar: لا توجد منتجات مفضلة بعد

# tapHeartToAddFavorites
source: Tap ♡ to add products to favorites
ar: اضغط على ♡ لإضافة منتجات للمفضلة

# removedFromFavorites
source: Removed {productName} from favorites
ar: تم إزالة {productName} من المفضلة

# addedToFavorites
source: Added {productName} to favorites
ar: تم إضافة {productName} للمفضلة

# logoutButton
source: Logout
ar: تسجيل الخروج

# locationAndDate
source: Khartoum - December 2024
ar: الخرطوم - ديسمبر 2024

# errorPrefix
source: Error:
ar: خطأ:

# categoriesTitle
source: Categories
ar: الفئات

source: Refresh
ar: تحديث

source: Loading categories...
ar: جاري تحميل الفئات...

source: No categories available
ar: لا توجد فئات متاحة

# failedToLoadCategories
source: Failed to load categories. Showing default categories.
ar: فشل في تحميل الفئات. يتم عرض الفئات الافتراضية.

source: Laptops
ar: لابتوبات

# categoryProducts
source: Products
ar: منتجات

# noProductsInCategory
source: No products in this category
ar: لا توجد منتجات في هذا التصنيف

source: Shopping Cart
ar: سلة المشتريات

# cartEmpty
source: Cart is empty
ar: السلة فارغة

source: Free
ar: مجاني

source: Shipping Cost
ar: تكلفة الشحن

source: Order Summary
ar: ملخص الطلب

source: Proceed to Checkout
ar: المتابعة للدفع

source: Item count:
ar: عدد العناصر:

source: items
ar: عنصر

source: Remove Product
ar: حذف المنتج

# removeProductConfirmation
source: Do you want to remove "{productName}" from cart?
ar: هل تريد حذف "{productName}" من السلة؟

# productRemovedFromCart
source: {productName} removed from cart
ar: تم حذف المنتج من السلة

source: Clear Cart
ar: مسح السلة

# clearCartConfirmation
source: Do you want to remove all products from cart?
ar: هل أنت متأكد من مسح جميع المنتجات من السلة؟

source: Cart cleared completely
ar: تم مسح السلة بالكامل

source: Clear All
ar: مسح الكل

# checkoutComingSoon
source: Checkout screen coming soon!
ar: صفحة الدفع ستتوفر قريباً!

source: Hide password
ar: إخفاء كلمة المرور

source: Show password
ar: إظهار كلمة المرور

# categoryPhones
source: Phones
ar: هواتف

# categoryComputers
source: Computers
ar: أجهزة كمبيوتر

# categoryHeadphones
source: Headphones
ar: سماعات

# categoryTablets
source: Tablets
ar: أجهزة لوحية

# categoryWatches
source: Watches
ar: ساعات

# categoryTv
source: TV
ar: تلفزيون

source: Shipping Address
ar: عنوان الشحن

# pleaseSelectAddress
source: Please select an address
ar: الرجاء تحديد عنوان

source: Shipping Method
ar: طريقة الشحن

# pleaseSelectShippingMethod
source: Please select a shipping method
ar: الرجاء تحديد طريقة الشحن

source: Clear Wishlist
ar: مسح المفضلة

source: Clear
ar: مسح

# languageArabic
source: Arabic
ar: العربية

source: Work
ar: العمل

# homeAddress
source: King Fahd Street, Riyadh, Saudi Arabia
ar: شارع الملك فهد، الرياض، المملكة العربية السعودية

# workAddress
source: King Abdullah Road, Riyadh, Saudi Arabia
ar: طريق الملك عبدالله، الرياض، المملكة العربية السعودية

# mustLoginFirst
source: You must log in first
ar: يجب تسجيل الدخول أولاً

source: Error loading addresses
ar: حدث خطأ في تحميل العناوين

source: No saved addresses
ar: لا توجد عناوين محفوظة

# addFirstAddress
source: Add your first address to get started
ar: أضف عنوانك الأول للبدء

source: Add New Address
ar: إضافة عنوان جديد

source: Standard Shipping
ar: الشحن العادي

# standardShippingDesc
source: Takes 5-7 business days
ar: يستغرق من 5-7 أيام عمل

source: Express Shipping
ar: الشحن السريع

# expressShippingDesc
source: Takes 2-3 business days
ar: يستغرق من 2-3 أيام عمل

source: Same Day Shipping
ar: الشحن في نفس اليوم

# sameDayShippingDesc
source: Your order arrives the same day
ar: يصلك طلبك في نفس اليوم

source: Gizmo Store Admin Panel
ar: لوحة إدارة جزمو ستور

source: Dashboard
ar: لوحة التحكم

source: Add Product
ar: إضافة منتج

source: Add Category
ar: إضافة فئة

source: Manage Products
ar: إدارة المنتجات

# welcomeToDashboard
source: Welcome to the Dashboard
ar: مرحباً بك في لوحة التحكم

source: Add New Product
ar: إضافة منتج جديد

source: Add New Category
ar: إضافة فئة جديدة

source: Manage Orders
ar: إدارة الطلبات

source: Sudanese Pound
ar: جنيه سوداني

source: US Dollar
ar: دولار أمريكي

source: Euro
ar: يورو

source: Saudi Riyal
ar: ريال سعودي

source: Emirati Dirham
ar: درهم إماراتي

source: Error loading categories
ar: خطأ في تحميل الفئات

source: Product added successfully
ar: تم إضافة المنتج بنجاح

source: Error adding product
ar: خطأ في إضافة المنتج

# addNewProductTitle
source: Add New Product
ar: إضافة منتج جديد

source: Product Name
ar: اسم المنتج

source: Please enter product name
ar: يرجى إدخال اسم المنتج

source: Product Description
ar: وصف المنتج

source: Please enter product description
ar: يرجى إدخال وصف المنتج

source: Please enter price
ar: يرجى إدخال السعر

# pleaseEnterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح

source: Please select category
ar: يرجى اختيار الفئة

source: Discount Percentage (%)
ar: نسبة الخصم (%)

# location
source: Khartoum, Sudan
ar: الموقع

source: Featured Product
ar: منتج مميز

source: Product Images
ar: صور المنتج

source: Image URL
ar: رابط الصورة

source: Specifications
ar: المواصفات

source: Specification
ar: مواصفة

source: Save Product
ar: حفظ المنتج

source: Search for product
ar: البحث عن منتج

# noProducts
source: No products found
ar: لا توجد منتجات

source: No name
ar: بدون اسم

# categoryLabel
source: Category:
ar: الفئة:

# priceLabel
source: Price:
ar: السعر:

# discountLabel
source: Discount:
ar: الخصم:

source: Hide
ar: إخفاء

source: Show
ar: إظهار

source: Confirm Delete
ar: تأكيد الحذف

# deleteProductConfirmation
source: Are you sure you want to delete the product "{productName}"?
ar: هل أنت متأكد من حذف المنتج "{productName}"؟

source: Product deleted successfully
ar: تم حذف المنتج بنجاح

source: Error deleting product
ar: خطأ في حذف المنتج

source: Product hidden
ar: تم إخفاء المنتج

source: Product shown
ar: تم إظهار المنتج

source: Error updating product
ar: خطأ في تحديث المنتج

source: Product Details
ar: تفاصيل المنتج

# descriptionLabel
source: Description:
ar: الوصف:

source: No description
ar: لا يوجد وصف

# stockLabel
source: Stock:
ar: المخزون:

# ratingLabel
source: Rating:
ar: التقييم:

# statusLabel
source: Status:
ar: الحالة:

source: Available
ar: متاح

source: Unavailable
ar: غير متاح

source: Close
ar: إغلاق

source: Edit Product
ar: تعديل المنتج

source: Error picking image
ar: خطأ في اختيار الصورة

source: Error uploading image
ar: خطأ في رفع الصورة

source: Error deleting image
ar: خطأ في حذف الصورة

source: Image deleted successfully
ar: تم حذف الصورة بنجاح

source: Product updated successfully
ar: تم تحديث المنتج بنجاح

source: Discount
ar: خصم

source: Images
ar: الصور

source: Add Image from Gallery
ar: إضافة صورة من المعرض

source: Selected Image:
ar: الصورة المختارة:

source: Current Images:
ar: الصور الحالية:

source: Add Specification
ar: إضافة مواصفة

source: Current Specifications:
ar: المواصفات الحالية:

source: Available for Sale
ar: متاح للبيع

source: Update Product
ar: تحديث المنتج

# categorySmartphones
source: Smartphones
ar: هواتف ذكية

# categoryLaptops
source: Laptops
ar: لابتوبات

# categorySmartWatches
source: Smart Watches
ar: ساعات ذكية

# categoryAccessories
source: Accessories
ar: إكسسوارات

# categoryCameras
source: Cameras
ar: كاميرات

# categoryGaming
source: Gaming
ar: ألعاب

# productIphone15ProDesc
source: Latest Apple phone with A17 Pro chip and enhanced camera
ar: أحدث هاتف من Apple مع شريحة A17 Pro وكاميرا محسنة

# productGalaxyS24UltraDesc
source: Samsung flagship phone with S Pen and 200MP camera
ar: هاتف Samsung الرائد مع قلم S Pen وكاميرا 200 ميجابكسل

# productPixel8ProDesc
source: Google phone with advanced AI and excellent camera
ar: هاتف Google مع ذكاء اصطناعي متقدم وكاميرا ممتازة

# productMacBookProDesc
source: Apple laptop with M3 Pro chip and Retina display
ar: لابتوب Apple مع شريحة M3 Pro وشاشة Retina

# productDellXpsDesc
source: Lightweight Dell laptop with Intel Core i7 processor
ar: لابتوب Dell خفيف الوزن مع معالج Intel Core i7

# productAirPodsProDesc
source: Apple wireless earphones with active noise cancellation
ar: سماعات Apple اللاسلكية مع إلغاء الضوضاء النشط

# productSonyWHDesc
source: Sony flagship headphones with excellent noise cancellation
ar: سماعات Sony الرائدة مع إلغاء الضوضاء الممتاز

# productAppleWatchDesc
source: Apple smart watch with advanced health monitoring
ar: ساعة Apple الذكية مع مراقبة الصحة المتقدمة

# productIpadProDesc
source: iPad Pro with M2 chip and Liquid Retina display
ar: جهاز iPad Pro مع شريحة M2 وشاشة Liquid Retina

# productMagSafeDesc
source: Apple wireless magnetic charger
ar: شاحن Apple اللاسلكي المغناطيسي

# productOnePlus12Desc
source: OnePlus phone with 100W fast charging and powerful performance
ar: هاتف ون بلس بشحن سريع 100 واط وأداء قوي

# productMacBookPro16M3MaxDesc
source: Apple professional laptop with M3 Max processor for designers and developers
ar: لابتوب آبل الاحترافي مع معالج M3 Max للمصممين والمطورين

# productDellXps15Desc
source: Dell professional laptop with 4K screen and powerful performance
ar: لابتوب ديل الاحترافي مع شاشة 4K وأداء قوي

# productIpadProM2Desc
source: Professional iPad with M2 processor and Liquid Retina XDR display
ar: جهاز آيباد الاحترافي مع معالج M2 وشاشة Liquid Retina XDR

# productGalaxyTabS9UltraDesc
source: Samsung tablet with large screen and S Pen
ar: جهاز لوحي من سامسونج بشاشة كبيرة وقلم S Pen

# productAppleWatchSeries9Desc
source: Apple smart watch with advanced health sensors
ar: ساعة آبل الذكية مع مستشعرات صحية متطورة

# productGalaxyWatch6Desc
source: Samsung smart watch with comprehensive health tracking
ar: ساعة سامسونج الذكية مع تتبع صحي شامل

# productAirPodsPro2Desc
source: Apple wireless earphones with active noise cancellation
ar: سماعات آبل اللاسلكية مع إلغاء الضوضاء النشط

# productSonyWH1000XM5Desc
source: Sony professional headphones with best noise cancellation
ar: سماعات سوني الاحترافية مع أفضل إلغاء ضوضاء

# sampleDataAddedSuccess
source: Sample data added successfully
ar: تم إضافة البيانات التجريبية بنجاح

# sampleDataAddError
source: Error adding sample data
ar: خطأ في إضافة البيانات التجريبية

source: Error fetching featured products
ar: خطأ في جلب المنتجات المميزة

source: Error fetching category products
ar: خطأ في جلب منتجات التصنيف

source: Error searching
ar: خطأ في البحث

source: Failed to add product
ar: فشل في إضافة المنتج

source: Failed to update product
ar: فشل في تحديث المنتج

source: Failed to delete product
ar: فشل في حذف المنتج

source: Failed to upload image
ar: فشل في رفع الصورة

source: Failed to delete image
ar: فشل في حذف الصورة

source: Error updating product status
ar: خطأ في تحديث حالة المنتج

source: Failed to update product status
ar: فشل في تحديث حالة المنتج

source: Error fetching product
ar: خطأ في جلب المنتج

# sampleDataCreatedSuccess
source: ✅ Sample data created successfully
ar: ✅ تم إنشاء البيانات التجريبية بنجاح

source: ❌ Error creating sample data
ar: ❌ خطأ في إنشاء البيانات التجريبية

# unexpectedError
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

# signOutFailed
source: Failed to sign out
ar: فشل في تسجيل الخروج

# passwordResetFailed
source: Failed to send password reset link
ar: فشل في إرسال رابط إعادة التعيين

source: Error creating user profile
ar: خطأ في إنشاء ملف المستخدم

source: Error creating guest profile
ar: خطأ في إنشاء ملف الضيف

source: Error updating last login
ar: خطأ في تحديث آخر تسجيل دخول

source: Error fetching user data
ar: خطأ في جلب بيانات المستخدم

source: Failed to update data
ar: فشل في تحديث البيانات

source: Error fetching user stats
ar: خطأ في جلب إحصائيات المستخدم

source: Error updating user stats
ar: خطأ في تحديث إحصائيات المستخدم

# userNotFound
source: No user found with this email
ar: لا يوجد مستخدم بهذا البريد الإلكتروني

# wrongPassword
source: Incorrect password
ar: كلمة مرور خاطئة

# emailAlreadyInUse
source: Email is already in use
ar: البريد الإلكتروني مستخدم بالفعل

# weakPassword
source: Password is too weak
ar: كلمة المرور ضعيفة جداً

# userDisabled
source: This account has been disabled
ar: تم تعطيل هذا الحساب

# tooManyRequests
source: Too many attempts. Try again later
ar: محاولات كثيرة جداً. حاول لاحقاً

# operationNotAllowed
source: This operation is not allowed
ar: هذه العملية غير مسموحة

# invalidCredential
source: Invalid credentials
ar: بيانات الاعتماد غير صحيحة

# networkRequestFailed
source: Network connection failed
ar: فشل في الاتصال بالشبكة

source: Requires recent login
ar: يتطلب تسجيل دخول حديث

# authenticationError
source: Authentication error occurred
ar: حدث خطأ في المصادقة

# guestName
source: Guest
ar: ضيف

source: Authentication failed
ar: فشل في المصادقة

# unexpectedSignInError
source: An unexpected error occurred during sign-in
ar: حدث خطأ غير متوقع أثناء تسجيل الدخول

source: Account creation failed
ar: فشل في إنشاء الحساب

# unexpectedSignUpError
source: An unexpected error occurred during account creation
ar: حدث خطأ غير متوقع أثناء إنشاء الحساب

source: Anonymous sign-in failed
ar: فشل في تسجيل الدخول كضيف
