Repository: mohammed-299kk/gizmo_store
Catalog: lib/l10n/app_*.arb
Languages: ar

# unexpectedAnonymousSignInError
source: An unexpected error occurred during anonymous sign-in
ar: حدث خطأ غير متوقع أثناء تسجيل الدخول كضيف

# unexpectedSignOutError
source: An unexpected error occurred during sign-out
ar: حدث خطأ غير متوقع أثناء تسجيل الخروج

# authGenericError
source: Authentication error occurred
ar: حدث خطأ في المصادقة

# orderStatusPreparing
source: Preparing
ar: قيد التحضير

# couponTypePercentage
source: {value}% discount
ar: خصم {value}%

# couponTypeFixed
source: {value} pound discount
ar: خصم {value} جنيه

# couponTypeFreeShipping
source: Free shipping
ar: شحن مجاني

# couponStatusActive
source: Active
ar: نشط

# couponStatusExpired
source: Expired
ar: منتهي الصلاحية

# couponStatusUsed
source: Used
ar: مستخدم

# couponStatusDisabled
source: Disabled
ar: معطل

# validationNameRequired
source: Name is required
ar: الاسم مطلوب

# validationNameTooShort
source: Name must be more than 2 characters
ar: الاسم يجب أن يكون أكثر من حرفين

# validationPhoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# validationPhoneInvalid
source: Invalid phone number
ar: رقم الهاتف غير صحيح

# validationStreetRequired
source: Street address is required
ar: عنوان الشارع مطلوب

# validationStreetTooShort
source: Street address must be more than 5 characters
ar: عنوان الشارع يجب أن يكون أكثر من 5 أحرف

# validationCityRequired
source: City is required
ar: المدينة مطلوبة

# validationCityTooShort
source: City name must be more than 2 characters
ar: اسم المدينة يجب أن يكون أكثر من حرفين

# validationStateRequired
source: State is required
ar: المنطقة مطلوبة

# validationPostalCodeRequired
source: Postal code is required
ar: الرمز البريدي مطلوب

# validationPostalCodeInvalid
source: Postal code must be 5 digits
ar: الرمز البريدي يجب أن يكون 5 أرقام

# validationCountryRequired
source: Country is required
ar: الدولة مطلوبة

source: Coupon applied successfully
ar: تم تطبيق الكوبون بنجاح

source: Profile Picture
ar: صورة الملف الشخصي

source: Change Photo
ar: تغيير الصورة

source: Add Photo
ar: إضافة صورة

source: Personal Information
ar: المعلومات الشخصية

# firstNameRequired
source: First name is required
ar: الاسم الأول مطلوب

# middleName
source: Middle Name (Optional)
ar: الاسم الأوسط (اختياري)

# lastNameRequired
source: Last name is required
ar: اسم العائلة مطلوب

source: Contact Information
ar: معلومات الاتصال

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# phoneOptional
source: Phone Number (Optional)
ar: رقم الهاتف (اختياري)

source: Current Password
ar: كلمة المرور الحالية

# currentPasswordRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة

source: New Password
ar: كلمة المرور الجديدة

# newPasswordRequired
source: New password is required
ar: كلمة المرور الجديدة مطلوبة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# confirmPasswordRequired
source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب

source: Choose Image Source
ar: اختر مصدر الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Error selecting image
ar: خطأ في اختيار الصورة

source: Selecting image...
ar: جاري اختيار الصورة...

source: Image selected successfully
ar: تم اختيار الصورة بنجاح

# fileNotFound
source: Selected file not found
ar: الملف المحدد غير موجود

source: Image selection cancelled
ar: تم إلغاء اختيار الصورة

source: Failed to select image
ar: فشل في اختيار الصورة

source: User not logged in
ar: المستخدم غير مسجل الدخول

source: Uploading image...
ar: جاري رفع الصورة...

source: Image uploaded successfully
ar: تم رفع الصورة بنجاح

source: Changes saved successfully
ar: تم حفظ التغييرات بنجاح

source: Failed to save changes
ar: فشل في حفظ التغييرات

# adminPanelTitle
source: Gizmo Store Admin Panel
ar: لوحة إدارة متجر جيزمو

# unauthorizedAccess
source: You are not authorized to access the admin panel
ar: غير مخول لك الوصول إلى لوحة الإدارة

source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صحيح

# accountDisabled
source: This account has been disabled
ar: تم تعطيل هذا الحساب

# tooManyAttempts
source: Too many attempts, please try again later
ar: محاولات كثيرة جداً، يرجى المحاولة لاحقاً

source: Login error
ar: خطأ في تسجيل الدخول

# onlyAdminAccess
source: Only admin can access this panel
ar: المدير فقط يمكنه الوصول إلى هذه اللوحة

source: Filter by Status
ar: تصفية حسب الحالة

source: Preparing
ar: قيد التحضير

source: Delivered
ar: تم التسليم

source: Cancelled
ar: ملغي

source: Loading orders...
ar: جاري تحميل الطلبات...

source: Error loading orders
ar: خطأ في تحميل الطلبات

source: No orders yet
ar: لا توجد طلبات بعد

source: No orders with status
ar: لا توجد طلبات بحالة

# startShoppingFirstOrder
source: Start shopping to create your first order
ar: ابدأ التسوق لإنشاء طلبك الأول

source: Order Details
ar: تفاصيل الطلب

source: Track Order
ar: تتبع الطلب

source: Order Date
ar: تاريخ الطلب

# paymentMethod
source: Payment Method: Credit Card
ar: طريقة الدفع: بطاقة ائتمان

# orderAddress
source: Address: Khartoum, Riyadh District, Nile Fahd Street
ar: العنوان: الخرطوم، حي الرياض، شارع النيل فهد

# orderProducts
source: Products:
ar: المنتجات:

# orderSubtotal
source: Subtotal:
ar: المجموع الفرعي:

# orderShipping
source: Shipping:
ar: الشحن:

# orderTax
source: Tax:
ar: الضريبة:

# orderGrandTotal
source: Grand Total:
ar: المجموع الإجمالي:

# loginRequiredForOrders
source: You must log in to view orders
ar: يجب تسجيل الدخول لعرض الطلبات

# errorLoadingOrdersMessage
source: An error occurred while loading orders
ar: حدث خطأ أثناء تحميل الطلبات

# retryLoading
source: Retry
ar: إعادة المحاولة

source: Shipping Information
ar: معلومات الشحن

# fullNameLabel
source: Full Name
ar: الاسم الكامل

source: Please enter full name
ar: يرجى إدخال الاسم الكامل

# addressLabel
source: Address
ar: العنوان

source: Please enter address
ar: يرجى إدخال العنوان

# cityLabel
source: City
ar: المدينة

source: Please enter city
ar: يرجى إدخال المدينة

# phoneLabel
source: Phone Number
ar: رقم الهاتف

# pleaseEnterPhone
source: Please enter phone number
ar: يرجى إدخال رقم الهاتف

# paymentMethodLabel
source: Payment Method
ar: طريقة الدفع

source: Credit Card
ar: بطاقة ائتمان

source: Cash on Delivery
ar: الدفع عند الاستلام

# productsLabel
source: Products:
ar: المنتجات:

# shippingLabel
source: Shipping:
ar: الشحن:

# taxLabel
source: Tax:
ar: الضريبة:

# grandTotalLabel
source: Grand Total:
ar: المجموع الإجمالي:

source: Complete Order
ar: إتمام الطلب

source: Order Completed
ar: تم إتمام الطلب

# orderCompletedMessage
source: Thank you! Your order has been completed successfully. We will contact you soon.
ar: شكراً لك! تم إتمام طلبك بنجاح. سنتواصل معك قريباً.

# completeOrderButton
source: Complete Order
ar: إتمام الطلب

# loadingText
source: Loading...
ar: جاري التحميل...

# redScreenIssueFixed
source: Red screen freeze issue has been fixed
ar: تم إصلاح مشكلة تجمد الشاشة الحمراء

source: Gizmo Store - Test
ar: متجر جيزمو - اختبار

source: Database Initialization
ar: تهيئة قاعدة البيانات

# readyToInitialize
source: Ready to initialize database
ar: جاهز لتهيئة قاعدة البيانات

source: Initializing database...
ar: جاري تهيئة قاعدة البيانات...

# startingInitialization
source: Starting database initialization...
ar: بدء تهيئة قاعدة البيانات...

source: Creating categories...
ar: إنشاء الفئات...

source: ✅ Categories created successfully
ar: ✅ تم إنشاء الفئات بنجاح

source: ✅ Products created successfully
ar: ✅ تم إنشاء المنتجات بنجاح

source: ✅ Database initialized successfully!
ar: ✅ تم تهيئة قاعدة البيانات بنجاح!

# initializationCompleted
source: 🎉 Database initialization completed successfully!
ar: 🎉 تم إكمال تهيئة قاعدة البيانات بنجاح!

source: Initialization Success
ar: نجح التهيئة

# initializationSuccessMessage
source: Database initialized successfully! You can now use the app.
ar: تم تهيئة قاعدة البيانات بنجاح! يمكنك الآن استخدام التطبيق.

# initializationFailed
source: ❌ Failed to initialize database
ar: ❌ فشل في تهيئة قاعدة البيانات

source: Operation Log:
ar: سجل العمليات:

source: Initialize Database
ar: تهيئة قاعدة البيانات

# startAddingProducts
source: Start adding products to your cart
ar: ابدأ بإضافة منتجات إلى سلتك

source: Browse Products
ar: تصفح المنتجات

source: Proceed to Payment
ar: متابعة الدفع

source: Cart cleared successfully
ar: تم مسح السلة بنجاح

# noProductDescription
source: No product description available.
ar: لا يوجد وصف للمنتج.

# reviewsSection
source: Reviews
ar: المراجعات

source: View All Reviews
ar: عرض جميع المراجعات

source: removed from wishlist
ar: تم إزالة

source: added to wishlist
ar: تم إضافة

source: from wishlist
ar: من المفضلة

source: to wishlist
ar: للمفضلة

source: Checkout page coming soon!
ar: صفحة الدفع ستتوفر قريباً!

source: Error fetching products
ar: خطأ في جلب المنتجات

source: Test
ar: اختبار

source: Smart Electronics Store
ar: متجر الإلكترونيات الذكي

# appWorkingSuccessfully
source: App is working successfully! 🎉
ar: التطبيق يعمل بنجاح! 🎉

# redScreenFreezeFixed
source: Red screen freeze issue has been fixed
ar: تم حل مشكلة تجميد الشاشة الحمراء

source: Sales
ar: المبيعات

# emptyWishlistTitle
source: Wishlist is empty
ar: قائمة المفضلة فارغة

# emptyWishlistMessage
source: Add products you like to access them easily later.
ar: أضف المنتجات التي تعجبك للوصول إليها بسهولة لاحقًا.

source: Shop Now
ar: تسوق الآن

source: Stock
ar: المخزون

# imageUploadSuccess
source: Image uploaded successfully
ar: تم رفع الصورة بنجاح

source: Image upload failed
ar: فشل في رفع الصورة

# changesSavedSuccess
source: Changes saved successfully
ar: تم حفظ التغييرات بنجاح

source: Set as default address
ar: تعيين كعنوان افتراضي

source: Address updated successfully
ar: تم تحديث العنوان بنجاح

source: Address added successfully
ar: تم إضافة العنوان بنجاح

# confirmDeleteAddress
source: Are you sure you want to delete the address for {name}?
ar: هل أنت متأكد من حذف العنوان الخاص بـ {name}؟

source: Saudi Arabia
ar: المملكة العربية السعودية

source: Phone Number
ar: رقم الهاتف

source: Street Address
ar: عنوان الشارع

source: Address set as default
ar: تم تعيين العنوان كافتراضي

source: Product
ar: منتج

# imageSelectionError
source: Error selecting image
ar: خطأ في اختيار الصورة

# imageSelectedSuccess
source: Image selected successfully
ar: تم اختيار الصورة بنجاح

source: Image selection failed
ar: فشل في اختيار الصورة

# saveChangesFailed
source: Failed to save changes
ar: فشل في حفظ التغييرات

source: Change Image
ar: تغيير الصورة

source: Place Order
ar: تأكيد الطلب

source: Order placed successfully!
ar: تم تأكيد الطلب بنجاح!

# errorPlacingOrder
source: Error placing order. Please try again.
ar: خطأ في تأكيد الطلب. يرجى المحاولة مرة أخرى.

# noAddressSelected
source: Please select a delivery address
ar: يرجى اختيار عنوان التوصيل

source: Delivery Address
ar: عنوان التوصيل

source: Change
ar: تغيير

source: Add Image
ar: إضافة صورة

source: Middle Name (Optional)
ar: الاسم الأوسط (اختياري)

# passwordMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Connected (if app running)
ar: متصل (إذا كان التطبيق يعمل)

source: Connected (if configured)
ar: متصل (إذا تم التكوين)

source: Data update failed
ar: فشل في تحديث البيانات

source: Failed to load user data
ar: فشل في تحميل بيانات المستخدم

# privacyAndSecuritySettingsUnderDevelopment
source: Privacy and security settings are under development
ar: إعدادات الخصوصية والأمان قيد التطوير

source: App
ar: التطبيق

# notificationManagementUnderDevelopment
source: Notification management is under development
ar: إدارة الإشعارات قيد التطوير

# helpAndSupportUnderDevelopment
source: Help and support is under development
ar: المساعدة والدعم قيد التطوير

source: Address Management Under Development
ar: إدارة العناوين قيد التطوير

source: Services Status
ar: حالة الخدمات

# tax
source: Tax (15%)
ar: الضريبة

source: Final Total
ar: المجموع النهائي

source: Payment page coming soon!
ar: صفحة الدفع ستتوفر قريباً!

source: Order created successfully!
ar: تم إنشاء الطلب بنجاح

source: Confirm Order
ar: تأكيد الطلب

source: Filters
ar: المرشحات

source: Minimum Rating
ar: الحد الأدنى للتقييم

source: Reset
ar: إعادة تعيين

source: Apply
ar: تطبيق

source: Previous Searches
ar: البحثات السابقة

# tryDifferentKeywords
source: Try different keywords or modify filters
ar: جرب كلمات مفتاحية مختلفة

source: Products
ar: المنتجات

source: App Name:
ar: اسم التطبيق

source: Project ID:
ar: معرف المشروع

source: API Key:
ar: مفتاح API

source: App ID:
ar: معرف التطبيق

source: Android Client ID:
ar: معرف عميل Android

source: iOS Client ID:
ar: معرف عميل iOS

source: Not Available
ar: غير متوفر

# authStatus
source: Authentication Status
ar: حالة المصادقة

source: Login Status:
ar: حالة تسجيل الدخول

source: Logged In
ar: مسجل الدخول

source: Not Logged In
ar: غير مسجل الدخول

source: Display Name:
ar: اسم العرض

source: Anonymous:
ar: مجهول

# firestoreStatus
source: Firestore: Connected (if app is working)
ar: حالة Firestore

# messagingStatus
source: Messaging: Connected (if configured)
ar: حالة الرسائل

# wishlistEmpty
source: Wishlist is empty
ar: قائمة الأمنيات فارغة

# addFavoriteProducts
source: Add your favorite products to access them easily later.
ar: أضف منتجات مفضلة

# clearWishlistConfirmation
source: Are you sure you want to clear all products from wishlist?
ar: تأكيد مسح قائمة الأمنيات

source: Special Offer
ar: عرض خاص

source: Up to 50% off
ar: خصم يصل إلى 50%

source: Available Coupons
ar: الكوبونات المتاحة

source: My Coupons
ar: كوبوناتي

# haveCouponCode
source: Have a coupon code?
ar: لديك رمز كوبون؟

source: Enter coupon code
ar: أدخل رمز الكوبون

# applyCoupon
source: Apply
ar: تطبيق الكوبون

source: Coupon applied:
ar: تم تطبيق الكوبون

source: Remove
ar: إزالة

# noCouponsAvailable
source: No coupons available currently
ar: لا توجد كوبونات متاحة

# noCouponsInWallet
source: No coupons in your wallet
ar: لا توجد كوبونات في المحفظة

source: Minimum Order
ar: الحد الأدنى للطلب

source: Maximum Discount
ar: الحد الأقصى للخصم

source: Valid Until
ar: صالح حتى

source: Code copied
ar: تم نسخ الرمز

source: Use
ar: استخدام

source: Expired
ar: منتهي الصلاحية

# errorAddingToCart
source: Error adding to cart: {error}
ar: خطأ في إضافة المنتج إلى السلة: {error}

# logoutConfirmationMessage
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

# pleaseLoginFirst
source: Please login first to add products to favorites
ar: يرجى تسجيل الدخول أولاً لإضافة المنتجات للمفضلة
